Sub-IoT/Sub-IoT-Stack/OLD/d7aoss/hal/efm32gg/emlib/src/em_cmu.c
/***************************************************************************//**
 * @file em_cmu.c
 * @brief Clock management unit (CMU) Peripheral API
 * @version 3.20.7
 *******************************************************************************
 * @section License
 * <b>(C) Copyright 2014 Silicon Labs, http://www.silabs.com</b>
 *******************************************************************************
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 * DISCLAIMER OF WARRANTY/LIMITATION OF REMEDIES: Silicon Labs has no
 * obligation to support this Software. Silicon Labs is providing the
 * Software "AS IS", with no express or implied warranties of any kind,
 * including, but not limited to, any implied warranties of merchantability
 * or fitness for any particular purpose or warranties against infringement
 * of any proprietary rights of a third party.
 *
 * Silicon Labs will not be liable for any consequential, incidental, or
 * special damages, or any other relief, or for any claim by any third party,
 * arising from your use of this Software.
 *
 ******************************************************************************/


#include "em_cmu.h"
#if defined( CMU_PRESENT )

#include "em_assert.h"
#include "em_bitband.h"
#include "em_emu.h"

/***************************************************************************//**
 * @addtogroup EM_Library
 * @{
 ******************************************************************************/

/***************************************************************************//**
 * @addtogroup CMU
 * @brief Clock management unit (CMU) Peripheral API
 * @{
 ******************************************************************************/

/*******************************************************************************
 ******************************   DEFINES   ************************************
 ******************************************************************************/

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

/** Maximum allowed core frequency when using 0 wait states on flash access. */
#define CMU_MAX_FREQ_0WS    16000000
/** Maximum allowed core frequency when using 1 wait states on flash access */
#define CMU_MAX_FREQ_1WS    32000000

#if defined( CMU_CTRL_HFLE )
/** Maximum frequency for HFLE needs to be enabled on Giant, Leopard and
    Wonder. */
#if defined (_EFM32_WONDER_FAMILY)
#define CMU_MAX_FREQ_HFLE   (24000000)
#elif defined (_EFM32_GIANT_FAMILY)
#define CMU_MAX_FREQ_HFLE   (CMU_MaxFreqHfle())
#else
#error Invalid part/device.
#endif
#endif

/** Low frequency A group identifier */
#define CMU_LFA             0

/** Low frequency B group identifier */
#define CMU_LFB             1

/** @endcond */

/*******************************************************************************
 **************************   LOCAL FUNCTIONS   ********************************
 ******************************************************************************/

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

#if defined( CMU_CTRL_HFLE ) && !defined (_EFM32_WONDER_FAMILY)
/***************************************************************************//**
 * @brief
 *   Return max allowed frequency for low energy peripherals.
 ******************************************************************************/
static uint32_t CMU_MaxFreqHfle(void)
{
  /* SYSTEM_GetFamily and SYSTEM_ChipRevisionGet could have been used here
     but we want to minimize dependencies in em_cmu.c. */
  uint16_t majorMinorRev;  
  uint8_t  deviceFamily = ((DEVINFO->PART & _DEVINFO_PART_DEVICE_FAMILY_MASK)
                           >> _DEVINFO_PART_DEVICE_FAMILY_SHIFT);
  switch (deviceFamily)
  {
  case _DEVINFO_PART_DEVICE_FAMILY_LG:
    /* CHIP MAJOR bit [3:0] */
    majorMinorRev = (((ROMTABLE->PID0 & _ROMTABLE_PID0_REVMAJOR_MASK)
                      >> _ROMTABLE_PID0_REVMAJOR_SHIFT) << 8);  
    /* CHIP MINOR bit [7:4] */
    majorMinorRev |= (((ROMTABLE->PID2 & _ROMTABLE_PID2_REVMINORMSB_MASK)
                       >> _ROMTABLE_PID2_REVMINORMSB_SHIFT) << 4);  
    /* CHIP MINOR bit [3:0] */
    majorMinorRev |=  ((ROMTABLE->PID3 & _ROMTABLE_PID3_REVMINORLSB_MASK)
                       >> _ROMTABLE_PID3_REVMINORLSB_SHIFT);
    
    if (majorMinorRev >= 0x0204)
      return 24000000;
    else
      return 32000000;
  case _DEVINFO_PART_DEVICE_FAMILY_GG:
    return 32000000;
  case _DEVINFO_PART_DEVICE_FAMILY_WG:
    return 24000000;
  default:
    /* Invalid device family. */
    EFM_ASSERT(false);
    return 0;
  }
}
#endif

/***************************************************************************//**
 * @brief
 *   Configure flash access wait states to most conservative setting for
 *   this target. Retain SCBTP setting.
 ******************************************************************************/
static void CMU_FlashWaitStateMax(void)
{
  uint32_t cfg;

  cfg = MSC->READCTRL;

  switch(cfg & _MSC_READCTRL_MODE_MASK)
  {
  case MSC_READCTRL_MODE_WS1:
  case MSC_READCTRL_MODE_WS0:

#if defined( MSC_READCTRL_MODE_WS2 )
  case MSC_READCTRL_MODE_WS2:
    cfg = (cfg & ~_MSC_READCTRL_MODE_MASK) | MSC_READCTRL_MODE_WS2;
#else
    cfg = (cfg & ~_MSC_READCTRL_MODE_MASK) | MSC_READCTRL_MODE_WS1;
#endif
    break;

#if defined( MSC_READCTRL_MODE_WS1SCBTP )
  case MSC_READCTRL_MODE_WS1SCBTP:
#endif
#if defined( MSC_READCTRL_MODE_WS0SCBTP )
  case MSC_READCTRL_MODE_WS0SCBTP:
#endif

#if defined( MSC_READCTRL_MODE_WS2SCBTP )
  case MSC_READCTRL_MODE_WS2SCBTP:
    cfg = (cfg & ~_MSC_READCTRL_MODE_MASK) | MSC_READCTRL_MODE_WS2SCBTP;
#elif defined( MSC_READCTRL_MODE_WS1SCBTP )
    cfg = (cfg & ~_MSC_READCTRL_MODE_MASK) | MSC_READCTRL_MODE_WS1SCBTP;
#endif
#if defined( MSC_READCTRL_MODE_WS2SCBTP ) || \
    defined( MSC_READCTRL_MODE_WS1SCBTP ) || defined( MSC_READCTRL_MODE_WS0SCBTP )
      break;
#endif
  }
  MSC->READCTRL = cfg;
}


/***************************************************************************//**
 * @brief Convert dividend to prescaler logarithmic value. Only works for even
 *        numbers equal to 2^n
 * @param[in] div Unscaled dividend,
 * @return Base 2 logarithm of input, as used by fixed prescalers
 ******************************************************************************/
__STATIC_INLINE uint32_t CMU_DivToLog2(CMU_ClkDiv_TypeDef div)
{
  uint32_t log2;

